## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| update | `aws_s3_object.manifest_file`                               |
| add    | `aws_quicksight_data_set.template-category-history`         |
|        | `aws_quicksight_refresh_schedule.template-category-history` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_data_set.template-category-history will be created
  + resource "aws_quicksight_data_set" "template-category-history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "template-category-history"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Template category history"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "tc-usage-history"

          + custom_sql {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "template-category-history"
              + sql_query       = <<-EOT
                    SELECT 
                                from_cat.name_en AS from_category,
                                to_cat.name_en AS to_category,
                                COUNT(DISTINCT th1.id) AS count
                            FROM 
                                templates_history th1
                            JOIN 
                                templates_history th2 ON th1.id = th2.id
                            JOIN 
                                template_categories from_cat ON th1.template_category_id = from_cat.id
                            JOIN 
                                template_categories to_cat ON th2.template_category_id = to_cat.id
                            WHERE 
                                th1.updated_At < th2.updated_at
                                AND th1.template_category_id != th2.template_category_id
                            GROUP BY 
                                from_cat.name_en, to_cat.name_en
                            ORDER BY 
                                count DESC
                EOT

              + columns {
                  + name = "from_category"
                  + type = "STRING"
                }
              + columns {
                  + name = "to_category"
                  + type = "STRING"
                }
              + columns {
                  + name = "count"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_refresh_schedule.template-category-history will be created
  + resource "aws_quicksight_refresh_schedule" "template-category-history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "template-category-history"
      + id             = (known after apply)
      + schedule_id    = "schedule-template-category-history"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:45"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_s3_object.manifest_file will be updated in-place
  ~ resource "aws_s3_object" "manifest_file" {
      ~ etag                   = "3696c2177cd9e1be28ff597c24b10ae0" -> "221f592f333f2fc284626cfdb8c4bc80"
        id                     = "quicksight/s3-manifest-sms-usage.json"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

39 tests, 19 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
